## [applications/baz/stage](https://omicron7.app.spacelift.io/stack/applications-baz-stage/run/01HSY8BGFNT1XQ51EYPX2Z77H6) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HSXGGSK801771R99VHETNHKY] Planning changes with 0 custom hooks...
ansible_host.app3: Refreshing state... [id=app3]
ansible_host.app2: Refreshing state... [id=app2]
ansible_host.app1: Refreshing state... [id=app1]
ansible_group.linux: Refreshing state... [id=stage]
data.spacelift_aws_integration.aws: Reading...
data.spacelift_current_stack.this: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=applications-baz-stage]
data.spacelift_stack.this: Reading...
data.spacelift_aws_integration.aws: Read complete after 0s [id=01HQV4XANFANXQY4NS3HDNJSCN]
data.spacelift_stack.this: Read complete after 0s [id=applications-baz-stage]
spacelift_stack.this: Preparing import... [id=applications-baz-stage]
spacelift_stack.this: Refreshing state... [id=applications-baz-stage]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

OpenTofu will perform the following actions:

  # ansible_group.linux will be destroyed
  # (because ansible_group.linux is not in configuration)
  - resource "ansible_group" "linux" {
      - id        = "stage" -> null
      - name      = "stage" -> null
      - variables = {
          - "ansible_user" = "root"
          - "os"           = "linux"
        } -> null
    }

  # ansible_group.stage will be created
  + resource "ansible_group" "stage" {
      + id        = (known after apply)
      + name      = "stage"
      + variables = {
          + "ansible_user" = "root"
          + "os"           = "linux"
        }
    }

  # ansible_host.app1 will be destroyed
  # (because ansible_host.app1 is not in configuration)
  - resource "ansible_host" "app1" {
      - groups    = [
          - "stage",
        ] -> null
      - id        = "app1" -> null
      - name      = "app1" -> null
      - variables = {
          - "ansible_host" = "127.0.0.1"
        } -> null
    }

  # ansible_host.app2 will be destroyed
  # (because ansible_host.app2 is not in configuration)
  - resource "ansible_host" "app2" {
      - groups    = [
          - "stage",
        ] -> null
      - id        = "app2" -> null
      - name      = "app2" -> null
      - variables = {
          - "ansible_host" = "127.0.0.1"
        } -> null
    }

  # ansible_host.app3 will be destroyed
  # (because ansible_host.app3 is not in configuration)
  - resource "ansible_host" "app3" {
      - groups    = [
          - "stage",
        ] -> null
      - id        = "app3" -> null
      - name      = "app3" -> null
      - variables = {
          - "ansible_host" = "127.0.0.1"
        } -> null
    }

  # ansible_host.baz will be created
  + resource "ansible_host" "baz" {
      + groups    = [
          + "stage",
        ]
      + id        = (known after apply)
      + name      = "baz"
      + variables = {
          + "ansible_host" = "localhost"
        }
    }

  # spacelift_aws_integration_attachment.aws will be created
  + resource "spacelift_aws_integration_attachment" "aws" {
      + attachment_id  = (known after apply)
      + id             = (known after apply)
      + integration_id = "01HQV4XANFANXQY4NS3HDNJSCN"
      + read           = true
      + stack_id       = (known after apply)
      + write          = true
    }

  # spacelift_environment_variable.terraform_state_key will be created
  + resource "spacelift_environment_variable" "terraform_state_key" {
      + checksum   = (known after apply)
      + id         = (known after apply)
      + name       = "TERRAFORM_STATE_KEY"
      + stack_id   = (known after apply)
      + value      = (sensitive value)
      + write_only = false
    }

  # spacelift_stack.ansible will be created
  + resource "spacelift_stack" "ansible" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "stage-testing"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "ansible",
          + "depends-on:applications-baz-stage",
        ]
      + manage_state                     = true
      + name                             = "Ansible (applications/baz/stage)"
      + protect_from_deletion            = false
      + repository                       = "spacelift-ansible"
      + runner_image                     = "public.ecr.aws/y7n4m3q8/spacelift-runner-ansible:latest"
      + slug                             = (known after apply)
      + space_id                         = "omicron7-01HS1TBZCJ35FSNJ9AC9QTY7WF"
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)

      + ansible {
          + playbook = "playbook.yml"
        }
    }

  # spacelift_stack.this will be updated in-place
  # (imported from "applications-baz-stage")
  ~ resource "spacelift_stack" "this" {
        additional_project_globs         = []
        administrative                   = true
        after_apply                      = []
        after_destroy                    = []
        after_init                       = []
        after_perform                    = []
        after_plan                       = []
        after_run                        = []
      ~ autodeploy                       = false -> true
        autoretry                        = false
        aws_assume_role_policy_statement = jsonencode(
            {
                Action    = "sts:AssumeRole"
                Condition = {
                    StringEquals = {
                        "sts:ExternalId" = "Omicron7@applications-baz-stage"
                    }
                }
                Effect    = "Allow"
                Principal = {
                    AWS = "324880187172"
                }
            }
        )
        before_apply                     = []
        before_destroy                   = []
        before_init                      = []
        before_perform                   = []
        before_plan                      = []
        branch                           = "main"
        enable_local_preview             = false
        github_action_deploy             = true
        id                               = "applications-baz-stage"
      ~ labels                           = [
            "feature:add_plan_pr_comment",
            "nobackend",
            "terraform",
          + "terraform+ansible",
        ]
        manage_state                     = false
        name                             = "applications/baz/stage"
        project_root                     = "applications/baz/stage"
        protect_from_deletion            = false
        repository                       = "terraform"
        slug                             = "applications-baz-stage"
        space_id                         = "omicron7-01HS1TBZCJ35FSNJ9AC9QTY7WF"
        terraform_external_state_access  = false
        terraform_smart_sanitization     = false
        terraform_version                = "~>1.6.2"
        terraform_workflow_tool          = "OPEN_TOFU"
    }

Plan: 1 to import, 5 to add, 1 to change, 4 to destroy.

[01HSXGGSK801771R99VHETNHKY] Changes are GO
[01HSXGGSK801771R99VHETNHKY] Uploading the list of managed resources...
[01HSXGGSK801771R99VHETNHKY] Please be aware that the run changes calculation includes output changes.
[01HSXGGSK801771R99VHETNHKY] Resource list upload is GO
[01HSXGGSK801771R99VHETNHKY] Generating JSON representation of the plan...
[01HSXGGSK801771R99VHETNHKY] JSON representation is GO
[01HSXGGSK801771R99VHETNHKY] Loading custom plan policy inputs...
[01HSXGGSK801771R99VHETNHKY] 0 custom plan policy inputs found
[01HSXGGSK801771R99VHETNHKY] No plan policies to evaluate
```

</details>